app/views/grupos/edit.html.erb

SELECT "users".* FROM "users"
---
  <%= f.input :nome_grupo, label: 'Nome' %>
  <%= f.collection_check_boxes :user_ids, User.all, :id, :email%>