app/views/grupos/show.html.erb

SELECT "usuario_grupos".* FROM "usuario_grupos" WHERE "usuario_grupos"."grupo_id" = $1  [["grupo_id", 2]]
---
  <strong>Usuários</strong>
  <% @grupo.usuario_grupos.each do |grupo| %>