app/controllers/grupos_controller.rb

SELECT "grupos".* FROM "grupos"
---
  def index
    @grupos = Grupo.all

INSERT INTO "grupos" ("nome_grupo", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["nome_grupo", "grupo 1"], ["created_at", "2019-05-01 19:10:57.500912"], ["updated_at", "2019-05-01 19:10:57.500912"]]
---
  def create
    @grupo = Grupo.new(grupo_params)

    respond_to do |format|
      if @grupo.save

UPDATE "grupos" SET "nome_grupo" = $1, "updated_at" = $2 WHERE "grupos"."id" = $3  [["nome_grupo", "grupo 2"], ["updated_at", "2019-05-01 19:11:21.530471"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @grupo.update(grupo_params)

DELETE FROM "grupos" WHERE "grupos"."id" = $1  [["id", 1]]
---
  def destroy
    @grupo.destroy

SELECT  "grupos".* FROM "grupos" WHERE "grupos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def convidar
    @grupo = Grupo.find(params[:id])

SELECT  "grupos".* FROM "grupos" WHERE "grupos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "aaa@a.com"], ["LIMIT", 1]]
INSERT INTO "usuario_grupos" ("user_id", "grupo_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["grupo_id", 2], ["created_at", "2019-05-01 20:14:45.263056"], ["updated_at", "2019-05-01 20:14:45.263056"]]
---
  def convite
    @grupo = Grupo.find(params[:id])
    user = User.find_by(email: params[:convite][:email])
    usuario_grupos = @grupo.usuario_grupos.create(user: user)

SELECT  "grupos".* FROM "grupos" WHERE "grupos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "sorteios" ("grupo_id", "remetente_id", "destinatario_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["grupo_id", 2], ["remetente_id", 2], ["destinatario_id", 2], ["created_at", "2019-05-01 21:05:17.588882"], ["updated_at", "2019-05-01 21:05:17.588882"]]
---
  def sorteio
    @grupo = Grupo.find(params[:id])
    lista = @grupo.usuario_grupos
    listaSorteada = lista.shuffle
    listaSorteada.each_with_index do |item, index|
      sorteado = Sorteio.new(grupo: @grupo, remetente_id: item.user_id, destinatario_id: listaSorteada[index - 1].user_id)
      sorteado.save

SELECT  "grupos".* FROM "grupos" WHERE "grupos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_grupo
      @grupo = Grupo.find(params[:id])