app/controllers/sorteios_controller.rb

    def index
      @sorteios = Sorteio.all
---
SELECT "sorteios".* FROM "sorteios"

    def show
      @sorteio = Sorteio.find(params[:id])
---
SELECT  "sorteios".* FROM "sorteios" WHERE "sorteios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]